import streamlit as st
import pandas as pd


st.sidebar.button('HOME')
st.title('Lets come to see the website that you brought the game to play!')

title = st.text_input('ใส่ชื่อของคุณ!')

game4 = st.sidebar.button('Game Ranking 2023')
adven = st.sidebar.button('Adventure')
horror = st.sidebar.button('Horror')
action = st.sidebar.button('Action')
moba = st.sidebar.button('moba')

if game4:
    st.header('*:red[10 เกมส์น่าเล่นในปี 2023]*')
    st.image('https://www.mustplay.in.th/static/thumb/2022/11/4/attach-1670154537977.jpg')
    st.write('2022 กำลังจะหมดไป 2023 กำลังจะเข้ามา! ซึ่งในปี 2023 นี้เป็นหนึ่งในปีที่วงการเกมมือถือค่อนข้างคึกคักเป็นพิเศษไม่แพ้ปี 2022 เพราะมีเกมมากคุณภาพจ่อคิวรอเผยข้อมูลหรือรอเปิดให้บริการอยู่เต็มไปหมด! ซึ่งวันนี้ผมได้ทำการคัด 10 เกมมือถือสุดน่าเล่นที่คาดว่าจะเปิดให้เล่นกันในปี 2023 มาให้กับเพื่อน ๆ แล้ว จะมีเกมอะไรบ้างนั้น เราไปดูกันครับ!')

    st.header('*:blue[Hogwarts Legacy]*')
    st.image('https://images.droidsans.com/wp-content/uploads/2023/02/Hogwarts-Legacy-1-scaled.jpg')
    st.write('Hogwarts Legacy เป็นเกมแอ็กชัน RPG แบบโลกเปิดที่ตั้งอยู่ในจักรวาลนิยายชุดแฮร์รี่ พอตเตอร์ เดินทางสู่สถานที่แสนคุ้นเคยและสำรวจสถานที่ใหม่ๆ เพื่อพบกับเหล่าสัตว์มหัศจรรย์ รวมถึงปรับแต่งตัวละครของคุณ ปรุงยา ฝึกฝนการร่ายคาถาให้เชี่ยวชาญ อัปเกรดทักษะและเป็นพ่อมดแม่มดในแบบที่คุณต้องการดำดิ่งเข้าสู่ฮอกวอตส์ในช่วงปลายยุค 1800 ตัวละครของคุณคือผู้กุมความลับโบราณที่อาจจะทำให้โลกแห่งเวทมนตร์นั้นสูญสิ้นไปได้ นอกจากนี้ สัมผัสประสบการณ์การอาศัยอยู่ในฮอกวอตส์และผูกมิตรกับผู้อื่นรวมถึงต่อสู้กับพ่อมดแม่มดแห่งความมืดเพื่อชี้ชะตาของโลกแห่งเวทมนตร์คุณคือผู้กำหนดตำนานของตัวเอง สัมผัสเรื่องราวที่ไม่เคยถูกเล่าขานมาก่อน')

    st.header('*:green[Brown Dust 2 จาก NEOWIZ]*')
    st.write('เกมแรกคือ Brown Dust 2 เป็นเกมแนว RPG จากซีรีส์ Brown Dust ที่กำลังจะสร้างตำนานบทใหม่ขึ้นอีกครั้งในภาคที่ 2 โดยในภาคนี้เราจะได้เห็นโลกสุดแฟนตาซีสุดยิ่งใหญ่ที่จะมาในรูปแบบของสองมิติสไตล์อนิเมะแบบจัดเต็ม ซึ่งเหล่าตัวละครหลักหน้าใหม่จะต้องออกผจญภัยไปในดันเจี้ยนสุดท้าทายและแสนหลากหลาย เพื่อกำจัดเหล่าศัตรูและเตรียมเผชิญกับเรื่องราวสุดเข้มข้นที่กำลังรอพวกเขาอยู่')
    st.image('https://www.mustplay.in.th/static/thumb/2022/10/28/attach-1669641261337.jpg')
    st.write('ล่าสุดทาง Official ได้ทำการปล่อยภาพวีดีโอใหม่ออกมาด้วย ซึ่งจะเป็นการโชว์คอนเซปต์สุดไฮป์อย่าง “เรื่องราวสุดหลากหลายของโลก Brown Dust” ที่มีทั้งโลกของไฮสคูลสุดแฟนตาซี, โลกหลังการล่มสลาย, และโลกของเหล่าสปายสุดปังให้เราได้เล่นกัน ความหลากหลายของโลกใน Brown Dust 2 นี้ขอบอกเลยว่ายิ่งทำให้เกมน่าสนใจขึ้นอีกหลายเท่าตัว! งานดีขนาดนี้เพื่อน ๆ เกมเมอร์สาย RPG ไม่ควรพลาดที่จะติดตามข่าวสารของเกมนี้อย่างใกล้ชิดครับ!')
    st.image('https://www.mustplay.in.th/static/thumb/2022/10/28/attach-1669641269796.jpg')

    st.header('*:green[Jujutsu Kaisen Phantom Parade จาก Sumzap]*')
    st.write('เกมที่สองคือ Jujutsu Kaisen Phantom Parade เป็นเกมแนว RPG ที่ได้นำอนิเมะชื่อดังอย่าง “มหาเวทย์ผนึกมาร” มาทำเป็นเกมมือถือสไตล์เทิร์นเบสกราฟิกสไตล์อนิเมะสุดอลังการให้เราได้เล่นกัน! โดยเหล่าตัวละครชื่อดังสุดเทพต่างยกขบวนกันมาอย่างครบครัน ซึ่งพวกเขาจะมาพร้อมกับภาพอิลลัสต์ประจำตัวสุดงานละเอียดแสนสวย ท่าไม้ตายสุดอลังการ เนื้อเรื่องสุดเข้มข้น และเสียงพากย์แบบจัดเต็มคาราเบล! ถือเป็นเกมจากอนิเมะที่สาวกมหาเวทย์ผนึกมารควรติดตามข่าวอย่างใกล้ชิดครับ!')
    st.image('https://www.mustplay.in.th/static/thumb/2022/10/28/attach-1669641806969.jpg')

    st.header('*:green[Black Clover Mobile: Rise of the Wizard King จาก Garena]*')
    st.write('เกมที่สามคือ Black Clover Mobile: Rise of the Wizard King เป็นเกมแนว RPG กราฟิกสไตล์อนิเมะที่ได้นำอนิเมะขวัญใจเกมเมอร์ไทยอย่าง "แบล็คโคลเวอร์" มาสร้างเป็นเกมสุดยิ่งใหญ่ให้เราได้เล่นกัน! โดยเกมเพลย์เบื้องต้นจะมาในสไตล์ของการต่อสู้แบบเทิร์นเบส ผสมผสานกับการออกผจญภัยในสไตล์ของ Open World MMORPG เราจึงจะได้ท่องไปในโลกของแบล็คโคลเวอร์กันแบบเต็มพิกัดเลย แน่นอนว่าเหล่าตัวละครหลักยกขบวนมากันครบพร้อมกับสกิลประจำตัวสุดอลังการ! ถ้าเป็นสาวกแบล็คโคลเวอร์ อย่าลืมตามข่าวกันอย่างใกล้ชิดด้วยนะครับ!')
    st.image('https://www.mustplay.in.th/static/thumb/2022/10/28/attach-1669642603455.jpg')

    st.header('*:green[Wuthering Waves จาก Kuro Games]*')
    st.write('เกมที่สี่คือ Wuthering Waves เป็นเกมแนว Open World Action RPG ที่เราจะได้ออกผจญภัยไปในโลกกว้างอย่างอิสระเพื่อเสาะหาไอเทมสุดแรร์พร้อมทั้งเข้าปะทะกับศัตรูด้วยทักษะการต่อสู้สุดลื่นไหล! โดยสิ่งที่ทำให้เกมนี้น่าเล่นมากคืองานภาพกราฟิกสามมิติเต็มรูปแบบสุดงดงามแสนละเอียด, การต่อสู้สไตล์ Action สุดมันส์แบบถึงพริกถึงขิง, และการสำรวจโลกไปพร้อมกับลูกเล่นแปลกใหม่สุดหลากหลายเฉพาะตัวของเกม! ถึงในตอนนี้ตัวเกมยังไม่มีกำหนดการใด ๆ ออกมา แต่ก็ถือเป็นเกมที่น่าจับตาและน่าติดตามข่าวสารความคืบหน้าของการพัฒนาเป็นอย่างมากในปี 2023 ครับ!')
    st.image('https://www.mustplay.in.th/static/thumb/2022/10/28/attach-1669643108464.jpg')

    st.header('*:green[Aster Tatariqus จาก FgG Studio]*')
    st.write('เกมที่ห้าคือ Aster Tatariqus เป็นเกมแนว Simulation Tactical RPG ที่เราจะได้ใช้ชีวิตร่วมไปกับเหล่านักรบสุดแกร่ง พร้อมทั้งจัดทีมและวางแผนการรบให้กับพวกเขาเพื่อกำจัดเหล่าศัตรูให้สิ้นซาก โดยเราจะได้ดื่มด่ำไปกับวิถีชีวิตของเหล่านักรบในแต่ละวัน และเพลิดเพลินไปกับฉากต่อสู้สุดอลังการด้วยงานภาพแบบสามมิติ พร้อมกับวางแผนการรบบนช่องสี่เหลี่ยมให้พวกเขาด้วยงานภาพสไตล์พิกเซลสองมิติ เป็นเกมสุดน่าสนใจที่เกมเมอร์สายวางแผนและสายเนื้อเรื่องต้องตามข่าววันเปิดอย่างใกล้ชิดครับ!')
    st.image('https://www.mustplay.in.th/static/thumb/2022/10/28/attach-1669644508309.jpg')

    st.header('*:green[Eversoul จาก Kakaogames]*')
    st.write('เกมที่หกคือ Eversoul เป็นเกมแนว Strategy RPG ที่เราจะได้ออกผจญภัยไปกับเหล่านักรบสุดแกร่งในดันเจี้ยนสุดลึกลับเพื่อไขปริศนาต่าง ๆ และวางแผนการรบให้กับเหล่านักรบเพื่อกำจัดเหล่ามอนสเตอร์สุดแกร่งให้หมด! โดยสิ่งที่ทำให้เกมนี้น่าเล่นมาก ๆ คืองานภาพแอนิเมชั่นของเหล่านักรบที่งานดีและสวยงามมาก อีกทั้งในดันเจี้ยนยังมาพร้อมกับสมบัติและปริศนามากมายที่รอให้เราเข้าไปท้าทายประลองปัญญากันอยู่! ถือเป็นหนึ่งในเกมที่ผมเชื่อว่าเกมเมอร์ทั่วโลกต่างรอคอยให้เปิดในเร็ว ๆ ในปี 2023 ครับ')
    st.image('https://www.mustplay.in.th/static/thumb/2022/10/28/attach-1669644797170.jpg')

    st.header('*:green[Ares: Rise of Guardian จาก Kakaogames]*')
    st.write('เกมที่เจ็ดคือ Ares: Rise of Guardian เป็นเกมแนว MMORPG ที่เราจะได้ท่องไปในโลกธีมไซไฟที่มีแต่เทคโนโลยีสุดล้ำหน้า โดยกราฟิกของเกมนี้จะเป็นสามมิติเต็มรูปแบบที่มีคุณภาพสูงและงานละเอียดมาก อีกทั้งยังมีตัวละครหลากคลาสหลายสกิลให้เราเลือกเล่นกัน ซึ่งขอบอกเลยว่าแต่ละคลาสทั้งเท่และโหดมากเลยล่ะ! และที่เด็ดที่สุดเลยก็คือระบบการต่อสู้มีความลื่นไหลและอลังการมาก แถมยังมาพร้อมกับลูกเล่นอย่างการขับหุ่นหรือใช้อุปกรณ์สุดทันสมัยเข้าปะทะกับศัตรูอีกด้วย! ถ้าชอบเกมธีมไซไฟภาพสวยบู๊แหลกมันส์ ๆ ผมบอกเลยว่าเกมนี้ต้องติดตาม!')
    st.image('https://www.mustplay.in.th/static/thumb/2022/10/28/attach-1669645094224.jpg')

    st.header('*:green[The Seven Deadly Sins Origins จาก Netmarble]*')
    st.write('เกมที่แปดคือ The Seven Deadly Sins Origins เป็นเกมแนว Open World Action RPG ที่เราจะได้ออกผจญภัยไปในโลกสุดกว้างใหญ่ของอนิเมะดัง “ศึกตำนาน 7 อัศวิน” โดยเกมนี้จะเป็นเกมภาคต่อของภาค Grand Cross ที่เราจะได้เดินทางไปในสถานที่ต่าง ๆ ของโลกใบนี้อย่างอิสระ พร้อมกับเข้าต่อสู้กับศัตรูด้วยทักษะและสกิลการต่อสู้สุดอลังการของเหล่านักรบในตำนาน! ถือเป็นเกมจาก 7 บาปที่ภาพสวยและน่าเล่นมาก ๆ น่าจะถูกใจสาวก 7 บาปและเกมเมอร์สายอนิเมะทุกคนอย่างแน่นอนครับ!')
    st.image('https://www.mustplay.in.th/static/thumb/2022/10/28/attach-1669645251832.jpg')

    st.header('*:green[Kart Rider Drift จาก NEXON]*')
    st.write('เกมที่เก้าคือ Kart Rider Drift เป็นเกมแนว Racing ที่เราจะได้ขับรถไปกับเหล่าตัวละครสุดน่ารักจากซีรีส์ของ Kartrider เข้าแข่งขันกับเพื่อน ๆ จากทั่วโลก! โดยความสนุกสนานต่าง ๆ ยังคงอยู่อย่างครบถ้วนทั้งโหมดความเร็วสุดมันส์ที่จะแพ้หรือชนะแข่งกันด้วยฝีมือชั้นเชิงในการขับ และโหมดไอเทมสุดปั่นที่ไม่เน้นฝีมือแต่เน้นจังหวะการใช้ไอเทม! ใช้ได้ใช้ดีมีชัยไปกว่าครึ่ง! และตามสไตล์เกมแข่งรถก็คือเราจะสามารถแต่งตัวละครสุดคิวท์และแต่งรถให้ออกมาสวยปังกว่าใครได้อีกด้วย! ถ้าชอบเกมแข่งรถจาก Kartrider ผมบอกเลยว่าเกมนี้ต้องเล่นครับในปี 2023!')
    st.image('https://www.mustplay.in.th/static/thumb/2022/10/28/attach-1669645448474.jpg')

    st.header('*:green[Project Overkill จาก NEXON]*')
    st.write('เกมที่สิบคือ Project Overkill เป็นเกมแนว Action ที่ได้นำโลกของ Dungeon Fighter Online มาพัฒนาใหม่ด้วย Unreal Engine 4 ทำให้ตัวเกมมีงานภาพกราฟิกที่อลังการกว่าเดิมโดยยังคงมุมมองแบบ Side-Scrolling ดั้งเดิมเอาไว้ โดยเหล่านักสู้จะเข้าปะทะกับศัตรูด้วยทักษะการต่อสู้สุดลื่นไหลที่มาพร้อมกับเอฟเฟกต์สกิลสุดปังแบบจัดเต็มคาราเบล นอกจากนี้ตัวเกมยังมาพร้อมกับฉากคัทซีนสุดงดงาม และดันเจี้ยนสุดหลากหลายที่เต็มไปด้วยกับดักหรือปริศนาที่เราจะต้องไขอีกด้วย! ถือเป็นอีกเกมที่น่าจับตามองในปี 2023 ครับ โดยเฉพาะสาวกสายบู๊นี่คือห้ามพลาด!')
    st.image('https://www.mustplay.in.th/static/thumb/2022/10/28/attach-1669646244295.jpg')

    st.subheader('และนี่ก็คือ 10 เกมมือถือสุดน่าเล่นที่คาดว่าจะเปิดให้เล่นกันในปี 2023 นะครับ จริง ๆ ยังมีเกมที่น่าสนใจและน่าติดตามในปี 2023 อีกเพียบเลย แต่ทั้ง 10 เกมนี้ถือเป็นไฮไลต์เด็ดของปี 2023 ที่ผมคัดมาให้แล้วแบบเน้น ๆ เพื่อน ๆ ชอบเกมไหนหรือสนใจเกมไหนเป็นพิเศษ ก็มาคุยกันได้เลยครับ! แล้วก็อย่าลืมแชร์บทความนี้ไปให้เพื่อนดูเพื่อหาเกมที่ถูกใจด้วยล่ะ ถ้าเกมเปิดจะได้ไปเล่นด้วยกันยังไงล่ะ!!')

if adven:
    st.header('1. ARK: Survival Evolved')
    st.image('https://assets.nintendo.com/image/upload/c_fill,w_1200/q_auto:best/f_auto/dpr_2.0/ncom/en_US/games/switch/a/ark-survival-evolved-switch/hero')
    st.write('ขณะที่ชายหรือหญิงคนหนึ่งเปลือยกายเปลือยเปล่า หนาวเหน็บและหิวโหยบนชายฝั่งของเกาะลึกลับที่ชื่อว่า ARK คุณต้องตามล่า เก็บเกี่ยวทรัพยากร ประดิษฐ์สิ่งของ ปลูกพืชผล วิจัยเทคโนโลยี และสร้างที่พักเพื่อต้านทานสภาพอากาศ ใช้ไหวพริบและทรัพยากรของคุณเพื่อฆ่าหรือทำให้เชื่องและขยายพันธุ์ไดโนเสาร์เลวีอาธานและสัตว์ดึกดำบรรพ์อื่น ๆ ที่สัญจรไปมาบนแผ่นดิน และร่วมทีมหรือล่าเหยื่อกับผู้เล่นอื่น ๆ หลายร้อยคนเพื่อเอาชีวิตรอด ครอง... และหลบหนี!')

    st.header('2. NARAKA: BLADEPOINT')
    st.image('https://cdn1.epicgames.com/offer/0c6aee83b9b64372bf44a043001325f2/EGS_NARAKABLADEPOINT_24Entertainment_S1_2560x1440-985473f9d33c11c46e35c8e02136ed0d')
    st.write('NARAKA: BLADEPOINT คือประสบการณ์ต่อสู้แบบ PVP ในตำนานที่เน้นแอ็กชันและรองรับผู้เล่นได้สูงสุด 60 คน พร้อมด้วยการต่อสู้ระยะประชิดที่ได้รับแรงบันดาลใจมาจากศิลปะการต่อสู้ การเคลื่อนไหวที่อยู่เหนือแรงโน้มถ่วง อาวุธระยะประชิดและระยะไกลมากมาย และฮีโร่ในตำนานที่ปรับแต่งได้ที่มีพลังอันยิ่งใหญ่')

    st.header('3. Grand Theft Auto V')
    st.image('https://cdn.cloudflare.steamstatic.com/steam/apps/271590/header.jpg?t=1671485100')
    st.write('เมื่อเด็กหนุ่มข้างถนน โจรปล้นธนาคารที่เกษียณแล้ว และโรคจิตที่น่าสะพรึงกลัวพบว่าตัวเองเข้าไปพัวพันกับองค์ประกอบที่น่ากลัวและบ้าคลั่งที่สุดของอาชญากรใต้ดิน รัฐบาลสหรัฐฯ และอุตสาหกรรมบันเทิง พวกเขาต้องพยายามปล้นแบบอันตรายเพื่อเอาชีวิตรอด ในเมืองที่ไร้ความปรานีซึ่งพวกเขาไม่สามารถไว้วางใจใครได้แม้แต่คนเดียว')

    st.header('4. The Sims™ 4')
    st.image('https://cdn.cloudflare.steamstatic.com/steam/apps/1222670/header.jpg?t=1677007281')
    st.write('ปลดปล่อยจินตนาการและสร้างโลกซิมที่มีเอกลักษณ์ซึ่งถ่ายทอดความเป็นตัวคุณ ดาวน์โหลดได้ฟรีแล้วปรับแต่งทุกรายละเอียด ตั้งแต่ซิมไปจนถึงบ้านและอื่นๆ อีกมากมาย เลือกลุค การแสดงออก และการแต่งตัวให้ซิม จากนั้นกำหนดว่าพวกเขาจะใช้ชีวิตแบบไหนในแต่ละวัน ออกแบบและสร้างบ้านที่น่าเหลือเชื่อให้แก่ทุกครอบครัว จากนั้นตกแต่งบ้านด้วยเครื่องเรือนและการตกแต่งที่คุณชื่นชอบ เดินทางไปยังละแวกบ้านต่างๆ ที่คุณสามารถพบกับซิมอื่นและเรียนรู้เกี่ยวกับชีวิตของพวกเขา ค้นพบสถานที่ที่สวยงามในสภาพแวดล้อมที่โดดเด่นและออกผจญภัยโดยไม่เตรียมการมาก่อน รับมือกับเรื่องต่างๆ ทั้งดีและร้ายในชีวิตประจำวันของซิมแล้วดูซิว่าจะเกิดอะไรขึ้นเมื่อคุณจำลองสถานการณ์จากชีวิตจริงของคุณ บอกเล่าเรื่องราวของคุณขณะที่พัฒนาความสัมพันธ์ต่างๆ ไขว่คว้าความก้าวหน้าในหน้าอาชีพการงานและไล่ตามความฝันในชีวิต สัมผัสประสบการณ์ในเกมที่ไม่ธรรมดานี้ซึ่งมีความเป็นไปได้ไม่สิ้นสุดด้วยตัวคุณเอง')

    st.header('5. Stardew Valley')
    st.image('https://cdn.cloudflare.steamstatic.com/steam/apps/413150/header.jpg?t=1666917466')
    st.write('คุณได้รับมรดกที่ดินฟาร์มเก่าของคุณปู่ใน Stardew Valley อาวุธครบมือและเหรียญไม่กี่เหรียญ คุณได้เริ่มต้นชีวิตใหม่ คุณสามารถเรียนรู้ที่จะใช้ชีวิตนอกพื้นที่และเปลี่ยนทุ่งรกร้างเหล่านี้ให้เป็นบ้านที่เจริญรุ่งเรืองได้หรือไม่? มันจะไม่ง่าย นับตั้งแต่ Joja Corporation เข้ามาในเมือง วิถีชีวิตแบบเก่าก็หายไปหมด ศูนย์ชุมชนซึ่งครั้งหนึ่งเคยเป็นศูนย์กลางกิจกรรมที่มีชีวิตชีวาที่สุดของเมือง บัดนี้อยู่ในสภาพโกลาหล แต่ดูเหมือนหุบเขาจะเต็มไปด้วยโอกาส ด้วยความทุ่มเทเพียงเล็กน้อย คุณอาจเป็นคนหนึ่งที่ฟื้นฟู Stardew Valley สู่ความยิ่งใหญ่!')

    st.header('6. UNCHARTED™: Legacy of Thieves Collection')
    st.image('https://cdn.cloudflare.steamstatic.com/steam/apps/1659420/header.jpg?t=1672777947')
    st.write('ในประสบการณ์ที่ผู้พัฒนาระดับมือรางวัลอย่าง Naughty Dog จะส่งมอบให้ในครั้งนี้นั้น UNCHARTED: Legacy of Thieves Collection ได้รวมเอาสองการผจญภัยแบบลุยเดี่ยวที่โด่งดังและประสบความสำเร็จล้นหลามทั่วโลกอย่าง UNCHARTED™ 4: A Thief’s End และ UNCHARTED™: The Lost Legacy มาด้วย เนื้อเรื่องแต่ละชุดนั้นเต็มไปด้วยเสียงหัวเราะ ดราม่าบีบหัวใจ และการต่อสู้สุดระทึก แถมยังให้สัมผัสของความอัศจรรย์ แมะทั้งหมดนี้นั้นรีมาสเตอร์มาใหม่เพื่อให้ยิ่งกินใจกว่าเดิม')

    st.header('7. God of War')
    st.image('https://cdn.cloudflare.steamstatic.com/steam/apps/1593500/header.jpg?t=1650554420')
    st.write('สู่ดินแดนแห่งนอร์ส การชำระแค้นกับเหล่าทวยเทพแห่งโอลิมปัสผ่านพ้นมาหลายปีแล้ว บัดนี้เครโทสใช้ชีวิตเยี่ยงชายคนหนึ่งในดินแดนของเหล่าเทพเจ้าแห่งนอร์สและหมู่มวลสัตว์ประหลาด ในโลกอันโหดร้ายและไม่ปรานีปราศรัยแห่งนี้ เขาต้องต่อสู้เพื่อเอาชีวิตรอด... และต้องสอนลูกชายให้ทำแบบเดียวกันด้วย')

    st.header('8. Sekiro™: Shadows Die Twice - GOTY Edition')
    st.image('https://cdn.cloudflare.steamstatic.com/steam/apps/814380/header.jpg?t=1669076148')
    st.write('ใน Sekiro™: Shadows Die Twice คุณคือ หมาป่าแขนเดียว นักรบผู้เสียศักดิ์ศรีและเสียโฉมที่ได้รับการช่วยเหลือจากความตาย เมื่อต้องปกป้องเจ้านายหนุ่มผู้สืบสายเลือดโบราณ คุณจึงตกเป็นเป้าหมายของศัตรูที่ร้ายกาจมากมาย รวมถึงกลุ่ม Ashina ที่อันตรายด้วย เมื่อลอร์ดหนุ่มถูกจับ ไม่มีอะไรจะหยุดคุณในภารกิจที่เต็มไปด้วยอันตรายเพื่อทวงคืนเกียรติยศ ไม่แม้แต่ความตาย')

    st.header('9. DARK SOULS™ III')
    st.image('https://cdn.cloudflare.steamstatic.com/steam/apps/374320/header.jpg?t=1671097812')
    st.write('เมื่อไฟมอดลงและโลกพังทลาย ออกเดินทางสู่จักรวาลที่เต็มไปด้วยศัตรูและสภาพแวดล้อมขนาดมหึมา ผู้เล่นจะดำดิ่งสู่โลกแห่งมหากาพย์บรรยากาศและความมืดผ่านการเล่นเกมที่เร็วขึ้นและการต่อสู้ที่เข้มข้นยิ่งขึ้น แฟน ๆ และผู้มาใหม่จะหลงทางในเกมเพลย์ที่ได้รับรางวัลและกราฟิกที่สมจริง ตอนนี้เหลือแต่ถ่านคุ… เตรียมตัวอีกครั้งและโอบกอดความมืดมิด!')

    st.header('10. vel’s Spider-Man Remastered')
    st.image('https://cdn.cloudflare.steamstatic.com/steam/apps/1817070/header.jpg?t=1673999865')
    st.write('Marvels Spider-Man Remastered สำหรับ PC พัฒนาโดย Insomniac Games ร่วมกับ Marvel และปรับแต่งให้เหมาะสมกับ PC โดย Nixxes Software ตัวเกมนำเสนอ Peter Parker ผู้เปี่ยมประสบการณ์ที่ต่อสู้กับอาชญกรรมที่ยิ่งใหญ่และวายร้ายผู้โด่งดังในเมืองนิวยอร์คของ Marvel ในเวลาเดียวกัน เขาก็ต้องพยายามสร้างสมดุลระหว่างชีวิตส่วนตัวและงานที่วุ่นวาย ขณะที่แบกรับชะตากรรมของนิวยอร์กในโลกของ Marvel ไว้บนไหล่ของเขา')

if horror:
    st.header('1. Pacify')
    st.image('https://cdn.cloudflare.steamstatic.com/steam/apps/967050/capsule_616x353.jpg?t=1639171467')
    st.write('คุณได้ลงชื่อกับ PAH Inc. บริษัท Paranormal Activity Helpers Incorporated ใช่ชื่อฟังดูไม่เท่ห์ แต่ได้เงินดีนะ พวกเขาบอกว่าคุณจะไม่อยู่ในอันตรายจริง ๆ ')

    st.header('2. Dead by Daylight')
    st.image('https://deadbydaylight.com/static/c3f2458c3a5bca701cb4ccc96f15cf66/653d1/dbd_keyart_tab_34c48816bb.jpg')
    st.write('Dead by Daylight เป็นเกมสยองขวัญแบบผู้เล่นหลายคน (4 ต่อ 1) ซึ่งผู้เล่นหนึ่งคนจะรับบทบาทเป็นฆาตกรป่าเถื่อน และอีกสี่คนจะเล่นเป็นผู้รอดชีวิตที่พยายามหลบหนีจากฆาตกรและหลบเลี่ยงไม่ให้ถูกจับ ถูกทรมาน และถูกฆ่า')

    st.header('3. Resident Evil Village')
    st.image('https://www.residentevil.com/village/assets/images/common/share.png')
    st.write('เหตุการณ์ครั้งนี้เกิดขึ้นหลังเรื่องราวน่าสยดสยองใน Resident Evil 7 biohazard ที่ได้รับคำชื่นชมจากนักวิจารณ์มากมาย เรื่องราวใหม่ทั้งหมดนี้เริ่มต้นด้วยชีวิตของอีธาน วินเทอร์สและมีอา ภรรยาของเขาที่ใช้ชีวิตอย่างสงบสุขในบ้านใหม่ เป็นอิสระจากฝันร้ายในอดีต ในขณะที่พวกเขากำลังสร้างชีวิตใหม่ไปด้วยกัน โศกนาฏกรรมก็มาเยือนทั้งสองอีกครั้ง')

    st.header('4. Project Zomboid')
    st.image('https://cdn.cloudflare.steamstatic.com/steam/apps/108600/header.jpg?t=1667832656')
    st.write('Project Zomboid เป็นแซนด์บ็อกซ์ที่เต็มไปด้วยซอมบี้แบบเปิด มันถามคำถามง่ายๆ - คุณจะตายอย่างไร?  ในเมือง Muldraugh และ West Point ผู้รอดชีวิตต้องปล้นบ้าน สร้างการป้องกัน และพยายามอย่างเต็มที่เพื่อชะลอความตายที่หลีกเลี่ยงไม่ได้ในแต่ละวัน ไม่ได้รับความช่วยเหลือ – การอยู่รอดอย่างต่อเนื่องของพวกเขาขึ้นอยู่กับไหวพริบ โชค และความสามารถในการหลบเลี่ยงฝูงชนที่ไม่หยุดยั้ง')

    st.header('5. Left 4 Dead 2')
    st.image('https://cdn.cloudflare.steamstatic.com/steam/apps/550/header.jpg?t=1675801903')
    st.write('เปิดฉากขึ้นท่ามกลางมหันตภัยซอมบี้ Left 4 Dead 2 (L4D2) เป็นภาคต่อจากเกม Left 4 Dead ที่คว้ารางวัลเกมแบบร่วมมือกันอันดับ 1 ประจำปี 2008 และเป็นเกมที่แฟน ๆ รอคอยกันอย่างใจจดใจจ่อมานาน เกมยิงมุมมองบุคคลที่หนึ่งแนวแอ็คชันสยองขวัญแบบร่วมมือกันนี้จะนำคุณและเพื่อน ๆ ของคุณเดินทางผ่านเมือง ที่ลุ่มน้ำขัง และสุสานต่าง ๆ ในรัฐที่เคยเป็นสมาพันธรัฐทางใต้ของอเมริกา ตั้งแต่เมืองซาวานนาห์จนถึงนิวออร์ลีนส์ ตะลุยผ่าน 5 แคมเปญแบบขยาย')

    st.header('6. Back 4 Blood')
    st.image('https://cdn.cloudflare.steamstatic.com/steam/apps/924970/header.jpg?t=1672856194')
    st.write('Back 4 Blood เป็นเกมยิงมุมมองบุคคลที่หนึ่งแบบร่วมมือกันสุดตื่นเต้นจากผู้สร้างแฟรนไชส์ ​​Left 4 Dead ที่ได้รับเสียงวิจารณ์ชื่นชม คุณเป็นศูนย์กลางของสงครามกับ Ridden โฮสต์ของปรสิตที่อันตรายถึงชีวิตเหล่านี้ได้กลายเป็นสิ่งมีชีวิตที่น่าสะพรึงกลัวซึ่งมุ่งหมายที่จะกลืนกินซากอารยธรรมที่ยังหลงเหลืออยู่ ด้วยการที่มนุษยชาติกำลังจะสูญพันธุ์ คุณและเพื่อนๆ จึงต้องต่อสู้กับศัตรู กำจัด The Ridden และกอบกู้โลกกลับคืนมา')

    st.header('7. DEVOUR')
    st.image('https://cdn.cloudflare.steamstatic.com/steam/apps/1274570/header.jpg?t=1671915042')
    st.write('DEVOUR เป็นเกมเอาชีวิตรอดสุดสยองขวัญแบบร่วมมือกันสำหรับผู้เล่น 1-4 คน หยุดสมาชิกลัทธิที่ถูกครอบงำก่อนที่พวกเขาจะลากคุณไปลงนรก จงวิ่ง กรีดร้อง หลบซ่อน ขอเพียงแค่ไม่โดนจับ')

    st.header('8. Ghost Watchers')
    st.image('https://cdn.cloudflare.steamstatic.com/steam/apps/1850740/header.jpg?t=1676996954')
    st.write('เกมมีผีอยู่ที่นี่ 8 ประเภท – โปรดอย่าลืมและนอกจากนั้นยังมีมอนสเตอร์! มีเครื่องมือที่มีรายละเอียดมากกว่า 20 เซฟเพื่อเก็บข้อมูลและต่อสู้กับผี! อย่าลืมกำหนดเงื่อนไขสำหรับอายุและอารมณ์ของผีได้ คุณจะต้องสามารถศึกษาผีได้เท่านั้นที่คุณจะจับผีได้!')

    st.header('9. Days Gone')
    st.image('https://cdn.cloudflare.steamstatic.com/steam/apps/1259420/header.jpg?t=1635476187')
    st.write('ก้าวเข้าสู่รองเท้าที่เต็มไปด้วยสิ่งสกปรกของอดีตนักขี่จักรยานนอกกฎหมาย Deacon St. John นักล่าเงินรางวัลที่พยายามหาเหตุผลที่จะมีชีวิตอยู่ในดินแดนที่ล้อมรอบด้วยความตาย ไล่ตามชุมชนร้างเพื่อหาอุปกรณ์เพื่อสร้างสิ่งของมีค่าและอาวุธ หรือใช้โอกาสของคุณร่วมกับผู้รอดชีวิตคนอื่นๆ ที่พยายามหาเลี้ยงชีพด้วยการค้าที่เป็นธรรม... หรือวิธีการที่รุนแรงกว่านั้น')

    st.header('10. Home Sweet Home')
    st.image('https://cdn.cloudflare.steamstatic.com/steam/apps/617160/header.jpg?t=1544779603')
    st.write('Home Sweet Home จะวางจำหน่ายแบบดิจิทัลบน Xbox One, PlayStation®4 และ PlayStation®VR สำหรับ PS4™ ในวันที่ 16 ตุลาคม Home Sweet Home ฉบับจริง ซึ่งรวมถึงเกมหลักและโหมด PS®VR จะวางจำหน่ายเฉพาะ ไปยังร้าน GameStop ทั่วอเมริกาเหนือในวันที่ 16 ตุลาคม')

if action:
    st.header('1. PUBG: BATTLEGROUNDS')
    st.image('https://cdn.cloudflare.steamstatic.com/steam/apps/578080/header.jpg?t=1673331963')
    st.write('ที่ดิน ยกเค้า เอาตัวรอด! เล่น PUBG: BATTLEGROUNDS ฟรี ลงจอดบนพื้นที่ยุทธศาสตร์ ปล้นอาวุธและเสบียง และเอาชีวิตรอดเพื่อเป็นทีมสุดท้ายที่ยืนอยู่ในสมรภูมิที่หลากหลายและหลากหลาย')

    st.header('2. Apex Legends™')
    st.image('https://cdn.cloudflare.steamstatic.com/steam/apps/1172470/header.jpg?t=1677136971')
    st.write('ชนะอย่างมีสไตล์ใน Apex Legends เกมยิงแนวฮีโรชูตเตอร์เล่นฟรี*ที่มีเหล่าตัวละครระดับตำนานซึ่งพกพาความสามารถอันทรงพลังมาร่วมกันต่อสู้เพื่อชื่อเสียงและความมั่งคั่ง ณ บริเวณสุดขอบของ Frontier')

    st.header('3. Team Fortress 2')
    st.image('https://cdn.cloudflare.steamstatic.com/steam/apps/440/header.jpg?t=1665425286')
    st.write('หนึ่งในเกมฟรีที่ได้รับคะแนนสูงสุดตลอดกาล! หนึ่งในเกมออนไลน์ชื่อดังตลอดกาล Team Fortress 2 ได้อัปเดตเกมโดยไม่คิดค่าใช้จ่ายอย่างเสมอมา - ทั้งโหมดเกมใหม่ แผนที่ อุปกรณ์ และที่สำคัญที่สุดซึ่งก็คือ หมวก เล่นเป็นหนึ่งในเก้าอาชีพที่แตกต่างกันในด้านความสามารถและบุคลิก และใช้ความสามารถของผู้เล่นมาปรับให้เข้ากับแต่ละหน่วย')

    st.header('4. Tom Clancy s Rainbow Six® Siege')
    st.image('https://cdn.cloudflare.steamstatic.com/steam/apps/359550/header.jpg?t=1676906895')
    st.write('Rainbow Six: Siege คือเกมชูตเตอร์หลายผู้เล่นมุมมองบุคคลที่หนึ่งรูปแบบใหม่ที่จะมอบประสบการณ์เล่นเกมที่เข้มข้นไม่เหมือนใคร มีเจ้าหน้าที่มากความสามารถให้เลือกอยากหลากหลาย หมั่นฝึกฝนทักษะให้เชี่ยวชาญเพื่อช่วยนำทีมของคุณผ่านความตึงเครียด ความตื่นเต้น และการต่อต่อสู้แบบทีมสุดระทึก ฝึกฝนศาสตร์แห่งการทำลายล้างและการใช้อุปกรณ์ใน Tom Clancy’s Rainbow Six: Siege เผชิญหน้ากับการต่อสู้ระยะใกล้ สถานการณ์เสี่ยงตาย การตัดสินใจเชิงกลยุทธ์ การเล่นเป็นทีมและการต่อสู้สุดเร้าใจ ร่วมเป็นส่วนหนึ่งของการจู่โจมรูปแบบใหม่โดยใช้อาวุธ และอุปกรณ์ที่มีพลังทำลายล้างอย่างมหาศาล ในการเล่นฝ่ายป้องกัน คุณต้องร่วมมือกับทีมเพื่อเปลี่ยนสิ่งแวดล้อมให้กลายเป็นที่กำบัง ดักจับและเสริมสร้างระบบการป้องกันเพื่อต้านการบุกทะลวงของศัตรู ในการเล่นฝ่ายบุก นำทีมของคุณผ่านพื้นที่คับแคบ ที่กำบังและกำแพงเสริมแกร่ง ผสมผสานกลยุทธ์จากแผนที่ โดรนสังเกตการณ์ โรยตัว และแผนอื่น ๆ เพื่อจู่โจมและควบคุมทุกสถานการณ์')

    st.header('5. Counter-Strike: Global Offensive')
    st.image('https://cdn.cloudflare.steamstatic.com/steam/apps/730/header.jpg?t=1668125812')
    st.write('"Counter-Strike ได้สร้างความแปลกใจให้กับอุตสาหกรรมเกม เมื่อม็อดม้ามืดกลายเป็นเกมแอ็คชัน PC ที่มีคนเล่นออนไลน์มากที่สุดในโลกเกือบทันทีหลังเกมเปิดให้เล่นในเดือนสิงหาคม 1999" Doug Lombardi จาก Valve กล่าว "ในช่วง 12 ปีที่ผ่านมา เกมนี้ยังคงเป็นหนึ่งในเกมที่มีคนเล่นมากที่สุดในโลก รวมทั้งเป็นเกมชูโรงในทัวร์นาเมนต์เกมการแข่งขัน และขายได้มากกว่า 25 ล้านชุดทั่วโลกทั้งแฟรนไชส์ CS:GO ขอสัญญาว่าจะขยายเกมเพลย์ที่ได้รับรางวัลของ CS ต่อไป และนำเสนอให้เกมเมอร์เล่นบน PC ตลอดจนคอนโซลรุ่นถัดไปและบน Mac"')

    st.header('6. Battlefield™ V')
    st.image('https://cdn.cloudflare.steamstatic.com/steam/apps/1238810/capsule_616x353.jpg?t=1664070673')
    st.write('นี่คือประสบการณ์การเล่น Battlefield™ V ที่สมบูรณ์ที่สุด เข้าร่วมความขัดแย้งที่ยิ่งใหญ่ที่สุดของมนุษยชาติในสมรภูมิบนผืนดิน ผืนฟ้า และผืนน้ำด้วยการปลดล็อกเนื้อหาเกี่ยวกับการเล่นทั้งหมดตั้งแต่เริ่ม เลือกอาวุธ พาหนะ และอุปกรณ์ต่างๆ จากคลังยุทโธปกรณ์ที่มีของครบแล้วต่อสู้ให้หนำใจในศึกใหญ่อันดุเดือดทั้งหลายของสงครามโลกครั้งที่ 2 โดดเด่นในสมรภูมิด้วยตัวละคร Elite ที่มีให้เลือกได้ครบทั้งหมดและเนื้อหาปรับแต่งที่ดีที่สุดของ Year 1 และ Year 2')

    st.header('7. Call of Duty®: Black Ops II')
    st.image('https://cdn.cloudflare.steamstatic.com/steam/apps/202970/header.jpg?t=1654830020')
    st.write('ก้าวข้ามขีดจำกัดของสิ่งที่แฟน ๆ คาดหวังจากแฟรนไชส์ความบันเทิงที่สร้างสถิติใหม่ Call of Duty®: Black Ops II ขับเคลื่อนผู้เล่นไปสู่อนาคตอันใกล้ สงครามเย็นในศตวรรษที่ 21 ที่ซึ่งเทคโนโลยีและอาวุธได้หลอมรวมกันเพื่อสร้างเจเนอเรชั่นใหม่ สงคราม')

    st.header('8. Rust')
    st.image('https://cdn.cloudflare.steamstatic.com/steam/apps/252490/header.jpg?t=1671160999')
    st.write('เป้าหมายเดียวใน Rust คือการเอาชีวิตรอด ทุกสิ่งต้องการให้คุณตาย - สัตว์ป่าบนเกาะและผู้อยู่อาศัยอื่นๆ สิ่งแวดล้อม และผู้รอดชีวิตคนอื่นๆ ทำทุกวิถีทางเพื่อคงอยู่อีกคืนหนึ่ง')

    st.header('9. Call of Duty®: Modern Warfare® II')
    st.image('https://cdn.cloudflare.steamstatic.com/steam/apps/1938090/header.jpg?t=1676681202')
    st.write('Call of Duty®: Modern Warfare® II นำผู้เล่นเข้าสู่ความขัดแย้งระดับโลกที่ไม่เคยมีมาก่อน ซึ่งนำเสนอการกลับมาของ Operators of Task Force 141 อันโด่งดัง ตั้งแต่ขนาดเล็ก กลยุทธ์การแทรกซึมที่มีเดิมพันสูง ไปจนถึงภารกิจที่เป็นความลับสูง ผู้เล่นจะเคลื่อนพลไปพร้อมกับเพื่อน ๆ ในประสบการณ์ที่ดื่มด่ำอย่างแท้จริง')

    st.header('10. Ready or Not')
    st.image('https://cdn.cloudflare.steamstatic.com/steam/apps/1144200/header.jpg?t=1672853208')
    st.write('โปรดจำไว้ว่ารุ่นเบต้ายังเป็นเกมเวอร์ชันไม่สมบูรณ์ จะยังคงมีจุดบกพร่องและความผิดปกติ และจะต้องใช้เนื้อหาเพิ่มเติมจำนวนมากก่อนที่จะพร้อมสำหรับการเปิดตัวเต็มรูปแบบ เนื่องจากผู้สนับสนุนของเราและด้วยความช่วยเหลือของคุณ เราจะผลักดัน Ready or Not ต่อไป เพิ่มเนื้อหา (แผนที่ใหม่ ภารกิจ ตัวละคร อาวุธ ฯลฯ) และปรับปรุงเพิ่มเติมเพื่อให้เกมมีมาตรฐานที่คุณสมควรได้รับ . ในที่สุด เราต้องการให้คุณปิดไฟ เพิ่มระดับเสียง และดำดิ่งสู่แอ็คชั่น นำความเป็นระเบียบมาสู่ความโกลาหล')

if moba:
    st.header('1. Dota 2')
    st.image('https://cdn.cloudflare.steamstatic.com/steam/apps/570/header.jpg?t=1675905833')
    st.write('เกมยอดนิยมที่สุดบน Steam ทุก ๆ วันผู้เล่นนับล้านทั่วโลกก้าวเข้าสู่สนามรบเพื่อสวมบทบาทเป็นหนึ่งในกว่าร้อยฮีโร่ของ Dota และไม่ว่าจะเป็นชั่วโมงที่ 10 ของการเล่นหรือชั่วโมงที่ 1,000 คุณจะค้นพบสิ่งใหม่ ๆ อยู่เสมอ ด้วยการอัปเดตสม่ำเสมอเพื่อให้แน่ใจว่าเกมเพลย์ คุณสมบัติ และฮีโร่นั้นพัฒนาต่อเนื่อง Dota 2 จึงถือกำเนิดขึ้นด้วยตัวเองอย่างแท้จริง')

    st.header('2. Rov')
    st.image('https://bangkokesports.com/wp-content/uploads/2019/02/6196806354556f9baeeae2f3c4d96d0b-768x432.webp')
    st.write('ตัวเกม RoV นั้นมีความเล่นง่ายกว่าเกม MOBA ในคอมพิวเตอร์มาก เช่นการเล็งโจมตี/สกิลให้อัตโนมัติ ทำให้ได้เข้าถึงกลุ่มผู้เล่นหน้าใหม่ได้ดี')

    st.header('3. League of Legends')
    st.image('https://www.leagueoflegends.com/static/open-graph-2e582ae9fae8b0b396ca46ff21fd47a8.jpg')
    st.write('เกมนี้ได้รับความนิยมเป็นอย่างมากในหมู่แฟนเกม MOBA จากทั่วทุกมุมโลก กับเกม League of Legends (LoL) ที่ได้แรงบันดาลใจมาจาก Dota กราฟิกทำออกมาได้ดีและตีตลาดมากกว่าเพราะมีตัวละคร (ในเกมเรียกว่า Champion) ตั้งแต่แนวน่ารักไปจนถึงสายดุดัน จึงไม่แปลกใจที่จะมีเกมเมอร์หญิงหลายคนถูกใจกับเกมนี้มากกว่าเกมอื่น ๆ แต่ละ Champion มีบทพูดในเกมที่แตกต่างกันทำให้ช่วยเสริมอารมณ์ผู้เล่นได้เป็นอย่างดี ')

    st.header('4. Smite')
    st.image('https://i.ytimg.com/vi/xAPsmI_zDZs/maxresdefault.jpg')
    st.write('นับเป็นเกมที่ยังมีคนเล่นอย่างต่อเนื่องและเพิ่มขึ้นเรื่อย ๆ กับเกม Smite โดยการเอาเทพเจ้าของประเทศต่าง ๆ ตามความเชื่อมาต่อสู้กัน ซึ่งเทพเจ้าเหล่านั้นมาจากแทบทุกมุมโลกเลยก็ว่าได้ เรียกว่าเอาใจสายวรรณกรรมและประวัติศาสตร์ได้เป็นอย่างดี ตัวเกมแตกต่างจากเกมอื่นคือมาในมุมมองของบุคคลที่ 3 ทำให้ภาพเคลื่อนไหวได้ง่ายและอาจจะน่าเวียนหัวสำหรับผู้เริ่มเล่น ')

    st.header('5. MARVEL Super War')
    st.image('https://promotions.co.th/wp-content/uploads/2019/05/MARVEL-Super-War.jpg')
    st.write('สำหรับแฟน ๆ Marvel เกมนี้คือเกม MOBA ที่น่าจะถูกใจคุณกันอย่างแน่นอน เพราะเกมนี้ได้ทำการรวบรวมตัวละครจากจักรวาล Marvel ทั้งฝั่งฮีโร่และวายร้ายมาให้คุณได้เลือกเล่นกันแบบเต็มอิ่ม ไม่ว่าจะเป็น ไอรอนแมน, กัปตันอเมริกา, ธอร์, สกาเล็ต วิทช์ หรือธานอส โดยตัวละครเหล่านี้จะถูกแบ่งออกเป็นสายต่าง ๆ เช่น สายปะทะ สายความเร็ว หรือสายพลังงาน เพื่อให้สอดคล้องกับตัวละครในเกม MOBA เกมอื่น ๆ ครับ')

    st.header('6. Mobile Legends: Bang Bang')
    st.image('https://www.gamingdose.com/wp-content/uploads/2019/06/ML_bb01.jpg')
    st.write('Mobile Legends เป็นเกมที่โด่งดังในภูมิภาคอาเซียนเป็นอย่างมากถึงขนาดมีการจัดการแข่งขันใน ASEAN Games เมื่อปี 2019 มาแล้ว เกมนี้เป็นมิตรกับผู้เล่น MOBA มือใหม่เป็นอย่างมาก เพราะมีการจัดวางหน้าจอที่ดูง่ายและมีตัวละครให้เลือกตามความชอบมากมาย ตัวป้อมมีความแข็งแกร่งกว่าเกม MOBA อื่น ๆ จึงจะใช้เวลาเล่นค่อนข้างนานกว่าเกมอื่นครับ')


    st.header('7. Heroes Evolved')
    st.image('https://cdn.cloudflare.steamstatic.com/steam/apps/534820/capsule_616x353.jpg?t=1635716637')
    st.write('Heroes Evolved เป็นเกม MOBA ชื่อดังในประเทศจีน ด้วยความนิยมนี้เองจึงได้มีการเปิดให้บริการบนมือถือตามมา ด้านตัวเกมยังคงมีวิธีการเล่นตามสไตล์เกม MOBA ที่หลายคนคุ้นเคย นั่นก็คือการทำลายป้อมของฝั่งตรงข้าม ตัวละครและแผนที่ที่ใช้ต่อสู้จะเป็นการนำมาจากเวอร์ชัน PC ที่เปิดให้บริการเลย ใครที่เคยเล่นเกมนี้ในเวอร์ชัน PC มาก่อน ก็สามารถมาเล่นอีกครั้งบนจอมือถือได้ครับ')

    st.header('8. Pokémon UNITE')
    st.image('https://play-lh.googleusercontent.com/ALjqMHXZ30ea4P26eF4pOWqraxvLTJBzrnk812_kbq-cS7Lv4MIOyN3oyv0B90NsvKc=w526-h296-rw')
    st.write('Pokémon Unite เป็นซีรีส์เกมโปเกมอนเกมแรกที่ทำออกมาในรูปแบบของแนวเกม MOBA ด้วยการต่อสู้แบบ 5 vs 5 ที่มาพร้อมกับการทำลายป้อมแนวใหม่ ที่ผู้เล่นต้องโยนลูกบอลให้ลงห่วงของฝ่ายตรงข้ามให้เต็มหลอดเพื่อทำลาย โดยภายในเกมผู้เล่นต้องเลือกโปเกมอน 1 ตัว ที่มีบทบาทหน้าที่แตกต่างกัน ไม่ว่าจะเป็น สายโจมตี สายแทงก์ สายสมดุล สายป่า และสายสนับสนุน')

    st.header('9. Onmyoji Arena')
    st.image('https://play-lh.googleusercontent.com/_9AVVM4OnBT7k2t4WOc6qKieUXmNq0hDZLonSadmPC2oLdHgcGHO4zJ088VTCzR64uqK')
    st.write('จุดเด่นของเกม MOBA เกมนี้คือมีการนำวัฒนธรรมและความเชื่อของชาวญี่ปุ่นมาตีความใหม่ เพราะเกมนี้เป็นเกมที่นำภูตผีหรือเรื่องเล่าของญี่ปุ่นออกมาออกแบบเป็นตัวละครที่เรียกว่าชิกิงามิ ผู้เล่นจะต้องควบคุมชิกิงามิเหล่านี้มาต่อสู้และทำลายป้อมในสนามที่สวยงาม สนามต่อสู้ในเกมนี้จะแสดงออกถึงความเป็นญี่ปุ่นอย่างชัดเจน ในขณะที่เหล่าชิกิงามิก็ถูกออกแบบมาให้ดูสวยงามเป็นอย่างยิ่งครับ')

    st.header('10. Survival Heroes')
    st.image('https://i0.wp.com/www.thailandesportclub.com/wp-content/uploads/2018/10/00-10.png')
    st.write('Survival Heroes เป็นเกมมือถือที่ผสมผสานระหว่างเกมแนว Battle Royale และเกม MOBA ไว้ด้วยกันได้อย่างลงตัว มีการออกแบบตัวเกมให้สามารถเล่นได้ง่ายบนมือถือ เกมนี้คุณสามารถเล่นคนเดียวหรือร่วมทีมกับเพื่อนเพื่อออกเดินทางในพื้นที่รกร้าง รวบรวมอาวุธและอุปกรณ์สำคัญเพื่อที่จะไปต่อสู้กับศัตรูที่เหลือ ผู้ที่อยู่รอดเป็นคนสุดท้ายเท่านั้นถึงจะเป็นผู้ชนะในเกมนี้')

exel = st.sidebar.button('จํานวนผู้เล่นเเต่ละเกมส์')

if exel:
    excel_file = 'peexpee.xlsx'
    df = pd.read_excel('peexpee.xlsx')

    # สร้าง UI ด้วย Streamlit
    st.write(df)

st.markdown(
    f"""
       <style>
       .stApp {{
           background-image: url("https://images.hdqwalls.com/wallpapers/ps5-games-4k-h0.jpg");
           background-attachment: fixed;
           background-size: cover;
           /* opacity: 0.3; */
       }}
       </style>
       """,
    unsafe_allow_html=True
)



